{
    "pages": [
        {
            "tags": "",
            "text": "Python é uma linguagem de programação. Python é uma linguagem de programação interpretada, de alto nível e de\npropósitos gerais. Foi criada por Guido van Rossum e sua primeira versão\nlançada em 1991.\nSuas principais características são legibilidade e espaços significantes .",
            "title": "Python",
            "url": "/python.html"
        },
        {
            "tags": "",
            "text": "Urubu é um micro CMS de arquivos estáticos. Isso significa... Isso significa nada de banco de dados ou configurações complexas, \ndireto do git para o servidor! Tudo o que precisamos é criar nossos arquivos .md e rodar o comando make para que sejam convertidos para arquivos .html . Isso é perfeito para você criar o seu próprio blog em python! Arquivos de conteúdo Todos os arquivos de conteúdo começam com uma sesssão delimitada por três traços --- onde definimos o title e o layout . Esta página por exemplo, começa assim: ---\ntitle: Urubu\nlayout: page\ncontent:\n    - jenkins\n    - python\n    - mais\n--- Depois disso basta escrever em markdown. Layouts Todos os arquivos de conteúdo utilizam a variável layout para especificar o\ndesenho da página. Existem alguns exemplos no diretório _layout , mas aqui vamos utilizar apenas\naquele chamado page .",
            "title": "Urubu",
            "url": "/index.html"
        },
        {
            "tags": "",
            "text": "",
            "title": "Search",
            "url": "/search.html"
        },
        {
            "tags": "",
            "text": "Jenkins é um software utilizado para CI/CD Jenkins Jenkins é uma ferramenta utilizada para integração contínua e entrega contínua , popularmente conhecido como CI/CD - C ontinuous I ntegration e C ontinuous D elivery.\nSeu papel é integrar à esteira de produção de software outros programas responsáveis por testes unitários, análise de código, testes de stress e qualidade para que então uma nova versão possa ser disponibilizada em produção, ou em algum repositório de artefatos, com uma alta taxa de confiabilidade.\nO Jenkins é um dos grandes nomes ao lado do Docker dentro do universo DevOps. Cada projeto dentro do Jenkins é conhecido como Job , sendo dois deles mais comuns, o freestyle e a pipeline . Freestyle Jobs do tipo freestyle são construídos pelo próprio painel do Jenkins e geralmente emendam vários passos em shell script, ou outros módulos de modo a criar uma esteira única. A vantagem desse tipo de job é a facilidade em criar pequenas automações principalmente em shell script , a desvantagem está na difícil manutenção e falta de padronização. Pipeline A pipeline tem sido a forma de trabalho padrão, inclusive em outras ferramentas, são scripts que controlam todos os estados da esteira, podem ser versionados e incluídos de repositórios remotos sob demanda. O Jenkins utiliza uma DSL chamda de Pipeline , e os arquivos ou a forma como é escrita recebe o nome de Jenkinsfile . Para casos mais complexos é possível utilizar Groovy como linguagem de script o que extenderá e muito a capacidade lógica da pipeline. Um exemplo da sintaxe de um Jenkinsfile seria o seguinte: pipeline { agent any stages { stage ( 'Build' ) { steps { echo 'Building..' } } stage ( 'Test' ) { steps { echo 'Testing..' } } stage ( 'Deploy' ) { steps { echo 'Deploying....' } } } }",
            "title": "Jenkins",
            "url": "/jenkins.html"
        },
        {
            "tags": "",
            "text": "Urubu",
            "title": "Mais",
            "url": "/mais/index.html"
        }
    ]
}